// this.$store.state.constants.sample -> 'test'
export var state = function() {
  return {
    sample: "test",
    pantVoice: [
      {
        name: "moderate",
        jpName: "控えめ",
        list: [
          "あっ…",
          "あぁ…",
          "やっ…",
          "やぁ…",
          "やだっ…",
          "だめ…",
          "んっ…",
          "んぅ…",
          "くぅ…",
          "ふぁ…"
        ],
        category: 0
      },
      {
        name: "ordinary",
        jpName: "普通",
        list: [
          "あ、",
          "あっ、",
          "あぁ、",
          "やぁ…っ、",
          "やだっ、",
          "だめ、",
          "だめぇ、",
          "いっ、",
          "イっ、",
          "ちょ、",
          "ふぁ、",
          "らめ、",
          "イッちゃ、",
          "っふぁ…っ、",
          "やぁ…っ、"
        ],
        category: 0
      },
      {
        name: "extreme",
        jpName: "激しめ",
        list: [
          "っあ！",
          "あっ!!",
          'ああ"っ！',
          "ぁぁぅ…!",
          "あぐっ！",
          "ぁん！",
          "ぃやっ…!",
          'い"っ？！',
          "うっ！",
          "ぅぅあっ!",
          "うひゃぁっ！",
          "ぃやっ…!",
          "しっぬ…っ！",
          "はあっ…！",
          "はひっ！",
          "ひぃ！",
          "ひっ！",
          "も…ぅぅあっ!",
          "もうダメっ…",
          "やっらっ!",
          "んんっ！",
          "んぁっう！",
          "あぐっ！",
          "やっ、だ…！"
        ],
        category: 0
      },
      {
        name: "heart",
        jpName: "♡",
        list: [
          "っ♡",
          "ぁ♡",
          "ぁっ♡",
          "あ♡",
          "あっ♡",
          "あぁっ♡",
          "あっあっ♡ ",
          "あんっ♡",
          "はっ♡",
          "はぁっ♡",
          "はぁぁっ♡",
          "ひゃ♡",
          "ひゃぁ♡",
          "ひん♡",
          "ふっ♡",
          "ふぅっ♡",
          "♡",
          "♡♡"
        ],
        category: 1
      },
      {
        name: "lipSound",
        jpName: "リップ音",
        list: [
          "っん…",
          "っぢゅ…",
          "じゅる、",
          "ちゅっ、",
          "ぢゅるる…",
          "ちゅむ…",
          "ちゅる、",
          "ぢゅ、",
          "は、",
          "はむ、",
          "ぷぁ…",
          "ふっ、",
          "ん、",
          "んぐ…",
          "んふ…",
          "ふっ、"
        ],
        category: 1
      }
    ],
    wordCount: [
      {
        name: "short",
        jpName: "短め",
        value: 3
      },
      {
        name: "medium",
        jpName: "普通",
        value: 5
      },
      {
        name: "long",
        jpName: "長め",
        value: 10
      }
    ]
  };
};
